# ДОМАШНЕЕ ЗАДАНИЕ. УРОК 4. Задания 3
#
# 3. Подготовить план выполнения некоторой части кода игры морской бой;
#
#
# 1. Отрисовать карту
# 2. Предложить пользователю выбрать как размещать корабли - автоматически или вручную
# 3. Если вручную:
#     3.1 Показать типы и количество кораблей
#     3.2 Запросить координату корабля.
#         3.2.1 Отрисовать.
#         3.2.2 Повторять до тех пор, пока корабль весь не разместится на карте.
#     3.3 Перейти к следующим кораблям.
#         3.3.1 Отрисовать.
#         3.3.2 Повторять до тех пор, пока все корабли не разместятся на карте.
# 4. Если автоматически:
#     4.1 Сгенерировать координаты кораблей случайным образом. Согласно набору правил.
#     4.2 Отрисовать корабли
# 5. Сгенерировать корабли противника (компьютер)
# 6. Объявить о начале игры
# 7. Запросить у пользователя координаты выстрела
# 8. Объявить пользователю о результате выстрела.
#     8.1 Отризовать результат на карте
#     8.2 При попадании повторять запрос выстрела
# 9. Передать ход противнику
# 10. Случайным образом выстрелить по полю пользователя
#     10.1 Отризовать результат на карте
#     10.2 При попадании повторять запрос выстрела
# 11. Повторять цикл с пункта 7 до победы кого-то из игроков
#     11.1 Победой считается ситуация, если противник потерял все корабли
#

