# ДОМАШНЕЕ ЗАДАНИЕ 7. Задание 5.

# 5. Написать регулярное выражение для строки вида “[2, 2]”
#   a. В квадратных скобках могут стоять любые две цифры
#   b. В квадратных скобках могут стоять два числа от 1 до 10 (для желающих)

def check(array, regexp)
  array.each do |string|
    result = string.match(regexp) ? 'подходит' : 'не подходит'
    puts "Строка \"#{string}\" \t\t#{result} \tпод шаблон [2, 2]"
  end
end

array = [
    '[2, 2]',
    '[[2, 2]]',
    '[x, y]',
    '[223, 2345]',
    'a[2, 2]',
    '[2, 2].',
    '[2, ,2]',
    '[0, 10]',
    '[1, 10]',
    '[1, 11]'
]
regexp_a = /^\[(\d+),\s*(\d+)\]$/
regexp_b = /^\[([1-9]|10),\s*([1-9]|10)\]$/

puts 'Шаблон а:'
check(array, regexp_a)
puts "\nШаблон b:"
check(array, regexp_b)


# РЕЗУЛЬТАТ:
# => Шаблон а:
# => Строка "[2, 2]" 		подходит 	под шаблон [2, 2]
# => Строка "[[2, 2]]" 		не подходит 	под шаблон [2, 2]
# => Строка "[x, y]" 		не подходит 	под шаблон [2, 2]
# => Строка "[223, 2345]" 		подходит 	под шаблон [2, 2]
# => Строка "a[2, 2]" 		не подходит 	под шаблон [2, 2]
# => Строка "[2, 2]." 		не подходит 	под шаблон [2, 2]
# => Строка "[2, ,2]" 		не подходит 	под шаблон [2, 2]
# => Строка "[0, 10]" 		подходит 	под шаблон [2, 2]
# => Строка "[1, 10]" 		подходит 	под шаблон [2, 2]
# => Строка "[1, 11]" 		подходит 	под шаблон [2, 2]

# => Шаблон b:
# => Строка "[2, 2]" 		подходит 	под шаблон [2, 2]
# => Строка "[[2, 2]]" 		не подходит 	под шаблон [2, 2]
# => Строка "[x, y]" 		не подходит 	под шаблон [2, 2]
# => Строка "[223, 2345]" 		не подходит 	под шаблон [2, 2]
# => Строка "a[2, 2]" 		не подходит 	под шаблон [2, 2]
# => Строка "[2, 2]." 		не подходит 	под шаблон [2, 2]
# => Строка "[2, ,2]" 		не подходит 	под шаблон [2, 2]
# => Строка "[0, 10]" 		не подходит 	под шаблон [2, 2]
# => Строка "[1, 10]" 		подходит 	под шаблон [2, 2]
# => Строка "[1, 11]" 		не подходит 	под шаблон [2, 2]




