require './classes/worker'
require './classes/helper'

# ДОМАШНЕЕ ЗАДАНИЕ. УРОК 4. Задания 7

# 7. * Существует класс Worker (работник), у каждого работника есть имя и зарплата, которые считываются с консоли.
#   Необходимо организовать консольный вывод списка сотрудников и их заработных плат.

Worker.show_all
Worker.route

# РЕЗУЛЬТАТ:
# СПИСОК СОТРУДНИКОВ:
# Сотрудник 1: Деметр     -> зарплата:  210 000р.
# Сотрудник 2: Виталий    -> зарплата:  120 000р.
# Сотрудник 3: Кирилл     -> зарплата:  300 000р.
# Сотрудник 4: Савелий    -> зарплата:  500 000р.
# Сотрудник 5: Николай    -> зарплата:  350 000р.
# Сотрудник 6: Виктор     -> зарплата:   50 000р.
#
# Выберите действие:
# 1 - добавить сотрудника
# 2 - изменить данные сотрудника
# 3 - удалить сотрудника
# 4 - вывести список сотрудников
# 5 - завершить работу и выйти из программы
#
# ... Далее программа делает то, что выбрал пользователь


